In [3]:
import pandas as pd
df = pd.DataFrame({'name':['Vishal','Pradumna','Abhinandan','Alok','Anupama','Arun','Avinash','Juber','Kedar',
                     'Pradnya','Santosh','Nilesh','Shubham'],
             'age':[21,23,32,45,67,12,45,67,80,23,45,34,22],
             'place':['Kop','Sangli','pune','satara','Kop','Sangli','pune','satara',
                      'Kop','Sangli','pune','satara','Nagar']})

df

          name  age   place
0       Vishal   21     Kop
1     Pradumna   23  Sangli
2   Abhinandan   32    pune
3         Alok   45  satara
4      Anupama   67     Kop
5         Arun   12  Sangli
6      Avinash   45    pune
7        Juber   67  satara
8        Kedar   80     Kop
9      Pradnya   23  Sangli
10     Santosh   45    pune
11      Nilesh   34  satara
12     Shubham   22   Nagar

In [6]:
#how many rows are present
df.shape[0]

13

In [7]:
# how many columns
df.shape[1]

3

In [8]:
#fetch the column names
df.columns

Index(['name', 'age', 'place'], dtype='object')

In [9]:
# fetch top 3 entries
df.head(3)

         name  age   place
0      Vishal   21     Kop
1    Pradumna   23  Sangli
2  Abhinandan   32    pune

In [10]:
#fetch last 2 entries
df.tail(2)

       name  age   place
11   Nilesh   34  satara
12  Shubham   22   Nagar

In [12]:
# I want data of name's only
df['name']

0         Vishal
1       Pradumna
2     Abhinandan
3           Alok
4        Anupama
5           Arun
6        Avinash
7          Juber
8          Kedar
9        Pradnya
10       Santosh
11        Nilesh
12       Shubham
Name: name, dtype: object

In [16]:
df.name

0         Vishal
1       Pradumna
2     Abhinandan
3           Alok
4        Anupama
5           Arun
6        Avinash
7          Juber
8          Kedar
9        Pradnya
10       Santosh
11        Nilesh
12       Shubham
Name: name, dtype: object

In [19]:
df.loc[:,'name']

0         Vishal
1       Pradumna
2     Abhinandan
3           Alok
4        Anupama
5           Arun
6        Avinash
7          Juber
8          Kedar
9        Pradnya
10       Santosh
11        Nilesh
12       Shubham
Name: name, dtype: object

In [20]:
df.loc[:,'name':'name']

          name
0       Vishal
1     Pradumna
2   Abhinandan
3         Alok
4      Anupama
5         Arun
6      Avinash
7        Juber
8        Kedar
9      Pradnya
10     Santosh
11      Nilesh
12     Shubham

In [22]:
df.iloc[:,[0]]

          name
0       Vishal
1     Pradumna
2   Abhinandan
3         Alok
4      Anupama
5         Arun
6      Avinash
7        Juber
8        Kedar
9      Pradnya
10     Santosh
11      Nilesh
12     Shubham

In [17]:
df[['name']]

          name
0       Vishal
1     Pradumna
2   Abhinandan
3         Alok
4      Anupama
5         Arun
6      Avinash
7        Juber
8        Kedar
9      Pradnya
10     Santosh
11      Nilesh
12     Shubham

In [24]:
# i want data of name and place
df[['place','name']]

     place        name
0      Kop      Vishal
1   Sangli    Pradumna
2     pune  Abhinandan
3   satara        Alok
4      Kop     Anupama
5   Sangli        Arun
6     pune     Avinash
7   satara       Juber
8      Kop       Kedar
9   Sangli     Pradnya
10    pune     Santosh
11  satara      Nilesh
12   Nagar     Shubham

In [25]:
# what are the different data types for columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    13 non-null     object
 1   age     13 non-null     int64
 2   place   13 non-null     object
dtypes: int64(1), object(2)
memory usage: 440.0+ bytes

In [27]:
df.dtypes

name     object
age       int64
place    object
dtype: object

In [29]:
#find out max age and min age
df.max()

name     Vishal
age          80
place    satara
dtype: object

In [31]:
df.age.max()

80

In [33]:
df['age'].min()

12

In [35]:
# find out average age
round(df.age.mean())

40

In [36]:
df.age.median()

34.0

In [ ]:
#central measures of tendacy

In [40]:
# fetch the record of an employee whose name is Arun
df[df.name=='Arun']

   name  age   place
5  Arun   12  Sangli

In [45]:
#fetch record of employe whose age is 45
df[df.age==45]

       name  age   place
3      Alok   45  satara
6   Avinash   45    pune
10  Santosh   45    pune

In [51]:
# fetch names of employess whose location is pune
df[df.place=='pune']

          name  age place
2   Abhinandan   32  pune
6      Avinash   45  pune
10     Santosh   45  pune

In [52]:
df[df.place=='pune'].name

2     Abhinandan
6        Avinash
10       Santosh
Name: name, dtype: object

In [53]:
df[df.place=='pune']['name']

2     Abhinandan
6        Avinash
10       Santosh
Name: name, dtype: object

In [55]:
# fetch names and age of employess whose location is pune
df[df.place=='pune'][['name','age']]

          name  age
2   Abhinandan   32
6      Avinash   45
10     Santosh   45

In [56]:
df

          name  age   place
0       Vishal   21     Kop
1     Pradumna   23  Sangli
2   Abhinandan   32    pune
3         Alok   45  satara
4      Anupama   67     Kop
5         Arun   12  Sangli
6      Avinash   45    pune
7        Juber   67  satara
8        Kedar   80     Kop
9      Pradnya   23  Sangli
10     Santosh   45    pune
11      Nilesh   34  satara
12     Shubham   22   Nagar

In [60]:
# fetch record of employees whose age=45 and place is pune#
df[(df.age==45) & (df.place=='pune')]

       name  age place
6   Avinash   45  pune
10  Santosh   45  pune

In [61]:
#or condition
df[(df.age==45) | (df.place=='pune')]

          name  age   place
2   Abhinandan   32    pune
3         Alok   45  satara
6      Avinash   45    pune
10     Santosh   45    pune

In [64]:
#find out the records whose age is max()
df.age.max()

80

In [66]:
#df.age==80
df[df['age']==df.age.max()]

    name  age place
8  Kedar   80   Kop

In [69]:
# Calculate Location wise count of employee
df.place.value_counts()

satara    3
Kop       3
pune      3
Sangli    3
Nagar     1
Name: place, dtype: int64

In [73]:
# who is from Nagar location
df[df.place=="Nagar"]

       name  age  place
12  Shubham   22  Nagar

In [77]:
#fetch records of employees whose name starts with A
df[df.name.str.startswith('A')]

         name  age   place
2  Abhinandan   32    pune
3        Alok   45  satara
4     Anupama   67     Kop
5        Arun   12  Sangli
6     Avinash   45    pune

In [78]:
df

          name  age   place
0       Vishal   21     Kop
1     Pradumna   23  Sangli
2   Abhinandan   32    pune
3         Alok   45  satara
4      Anupama   67     Kop
5         Arun   12  Sangli
6      Avinash   45    pune
7        Juber   67  satara
8        Kedar   80     Kop
9      Pradnya   23  Sangli
10     Santosh   45    pune
11      Nilesh   34  satara
12     Shubham   22   Nagar

In [ ]:
#find the employee name whose age is >25

In [ ]:
# find count of emplyees from Sangli
# What is location of Nilesh
# What is place of 'Pradnya
# employee whose name endswith h
# employee name whose age is min
# find employee from satara whose age is max
# how many employees are there whose age is 23
# who is yougest employee of a company